Repository: GnaneshK24/womensafety
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# appTitle
source: Women Safety App
hi: महिला सुरक्षा ऐप
ta: பெண்கள் பாதுகாப்பு செயலி

# welcomeMessage
source: Welcome Back!
hi: सेफ़ोन में आपका स्वागत है
ta: சேஃப்ஜோனுக்கு வரவேற்கிறோம்

# safetyMessage
source: Your safety is our priority
hi: एक टैप से आपकी सुरक्षा सुनिश्चित करना
ta: ஒரு தட்டுடன் உங்கள் பாதுகாப்பை உறுதி செய்கிறது

source: Email
hi: ईमेल
ta: மின்னஞ்சல்

source: Password
hi: पासवर्ड
ta: கடவுச்சொல்

source: Login
hi: लॉग इन
ta: உள்நுழைய

source: Forgot Password?
hi: पासवर्ड भूल गए?
ta: கடவுச்சொல் மறந்துவிட்டதா?

# signUp
source: Don't have an account? Sign Up
hi: खाता नहीं है? साइन अप करें
ta: கணக்கு இல்லையா? பதிவு செய்யவும்

source: Home
hi: होम
ta: முகப்பு

source: Contacts
hi: संपर्क
ta: தொடர்புகள்

source: Services
hi: सेवाएं
ta: சேவைகள்

source: Settings
hi: सेटिंग्स
ta: அமைப்புகள்

# mapAndReviews
source: Map & Reviews
hi: मानचित्र और समीक्षाएं
ta: வரைபடம் மற்றும் மதிப்புரைகள்

source: Self Defense
hi: स्व-रक्षा
ta: சுய பாதுகாப்பு

source: SOS EMERGENCY
hi: एसओएस आपातकाल
ta: SOS அவசரநிலை

# newsAndArticles
source: News & Articles
hi: समाचार और लेख
ta: செய்திகள் மற்றும் கட்டுரைகள்

source: Welfare Laws
hi: कल्याण कानून
ta: நல்வாழ்வு சட்டங்கள்

source: Dark Mode
hi: डार्क मोड
ta: இருண்ட பயன்முறை

# toggleTheme
source: Toggle dark/light theme
hi: डार्क/लाइट थीम बदलें
ta: இருண்ட/ஒளி பயன்முறை மாற்ற

source: Language
hi: भाषा
ta: மொழி

source: Notifications
hi: सूचनाएं
ta: அறிவிப்புகள்

# enableNotifications
source: Enable or disable notifications
hi: सूचनाएं सक्षम या अक्षम करें
ta: அறிவிப்புகளை இயக்கு அல்லது முடக்கு

source: Sound Effects
hi: ध्वनि प्रभाव
ta: ஒலி விளைவுகள்

# enableSoundEffects
source: Enable or disable sound effects
hi: ध्वनि प्रभाव सक्षम या अक्षम करें
ta: ஒலி விளைவுகளை இயக்கு அல்லது முடக்கு

source: Font Size
hi: फ़ॉन्ट आकार
ta: எழுத்து அளவு

source: Emergency Contacts
hi: आपातकालीन संपर्क
ta: அவசர தொடர்புகள்

source: Contact
hi: संपर्क
ta: தொடர்பு

source: Save Contacts
hi: संपर्क सहेजें
ta: தொடர்புகளை சேமி

source: Send Location
hi: स्थान भेजें
ta: இருப்பிடத்தை அனுப்பு

# contactsSaved
source: Contacts saved successfully
hi: संपर्क सफलतापूर्वक सहेजे गए
ta: தொடர்புகள் வெற்றிகரமாக சேமிக்கப்பட்டன

# contactPermissionDenied
source: Permission to access contacts was denied
hi: संपर्क अनुमति अस्वीकृत
ta: தொடர்பு அனுமதி மறுக்கப்பட்டது

source: Ambulance
hi: एम्बुलेंस
ta: ஆம்புலன்ஸ்

source: Fire Service
hi: फायर सर्विस
ta: தீயணைப்பு சேவை

source: Child Care
hi: बाल देखभाल
ta: குழந்தை பாதுகாப்பு

source: Police
hi: पुलिस
ta: காவல்துறை

source: Women's Helpline
hi: महिला हेल्पलाइन
ta: பெண்கள் உதவி மையம்

source: Domestic Abuse Helpline
hi: घरेलू हिंसा हेल्पलाइन
ta: குடும்ப வன்முறை உதவி மையம்

source: Cyber Crime Helpline
hi: साइबर अपराध हेल्पलाइन
ta: சைபர் குற்ற உதவி மையம்

source: Railway Helpline
hi: रेलवे हेल्पलाइन
ta: ரயில்வே உதவி மையம்

source: Senior Citizen Helpline
hi: वरिष्ठ नागरिक हेल्पलाइन
ta: மூத்த குடிமக்கள் உதவி மையம்

source: Nirbhaya Helpline
hi: निर्भया हेल्पलाइन
ta: நிர்பயா உதவி மையம்

source: Logout
hi: लॉग आउट
ta: வெளியேறு

# logoutConfirmation
source: Are you sure you want to logout?
hi: क्या आप लॉग आउट करना चाहते हैं?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

source: Cancel
hi: रद्द करें
ta: ரத்து செய்

# sosAlertTitle
source: SOS Alert
hi: 🚨 एसओएस अलर्ट
ta: 🚨 SOS எச்சரிக்கை

# sosAlertMessage
source: This will send your location to your emergency contacts and call the police if enabled. Do you want to proceed?
hi: क्या आप एसओएस को सक्रिय करना चाहते हैं? यह आपका स्थान आपातकालीन संपर्कों के साथ साझा करेगा।
ta: SOS-ஐ இயக்க விரும்புகிறீர்களா? இது உங்கள் இருப்பிடத்தை அவசர தொடர்புகளுடன் பகிரும்.

source: Proceed
hi: आगे बढ़ें
ta: தொடர்க

# sosSuccess
source: Emergency contacts have been notified with your location
hi: एसओएस सक्रिय! स्थान आपातकालीन संपर्कों के साथ साझा किया गया।
ta: SOS இயக்கப்பட்டது! இருப்பிடம் அவசர தொடர்புகளுடன் பகிரப்பட்டது.

# sosError
source: Error sending SOS. Please try again.
hi: एसओएस सक्रिय करने में त्रुटि: {error}
ta: SOS இயக்குவதில் பிழை: {error}

# policeCallTitle
source: Emergency Police Call
hi: आपातकालीन पुलिस कॉल
ta: அவசரகால காவல்துறை அழைப்பு

# policeCallDescription
source: Automatically call police (100) when SOS is pressed
hi: एसओएस दबाने पर स्वचालित रूप से पुलिस (100) को कॉल करें
ta: SOS அழுத்தும்போது தானாகவே காவல்துறையை (100) அழைக்கவும்

# selfDefenseTitle
source: Self Defense Videos
hi: स्व-रक्षा वीडियो
ta: சுய பாதுகாப்பு வீடியோக்கள்

# selfDefenseDescription
source: Learn essential self-defense techniques to protect yourself in emergency situations
hi: आपातकालीन स्थितियों में खुद की रक्षा के लिए आवश्यक स्व-रक्षा तकनीक सीखें
ta: அவசரகால சூழ்நிலைகளில் உங்களைப் பாதுகாக்க அத்தியாவசிய சுய பாதுகாப்பு நுட்பங்களைக் கற்றுக்கொள்ளுங்கள்

source: Basic Self Defense
hi: बुनियादी स्व-रक्षा
ta: அடிப்படை சுய பாதுகாப்பு

# escapeAttacker
source: Escape an Attacker
hi: हमलावर से बचकर भागना
ta: தாக்குபவரிடமிருந்து தப்பித்தல்

# easySelfDefenseMoves
source: 5 Easy Self-Defense Moves
hi: 5 आसान स्व-रक्षा तकनीक
ta: 5 எளிய சுய பாதுகாப்பு நுட்பங்கள்

# knifeAttackDefense
source: Self Defense Against Knife Attack
hi: चाकू के हमले से बचाव
ta: கத்தி தாக்குதலுக்கு எதிரான சுய பாதுகாப்பு

# breakFreeAttacker
source: How to Break Free from an Attacker
hi: हमलावर से कैसे छुटकारा पाएं
ta: தாக்குபவரிடமிருந்து எப்படி விடுபடுவது

# simpleSelfDefenseTips
source: Simple Self-Defense Tips for Women
hi: महिलाओं के लिए सरल स्व-रक्षा टिप्स
ta: பெண்களுக்கான எளிய சுய பாதுகாப்பு உதவிக்குறிப்புகள்

source: Play Video
hi: वीडियो चलाएं
ta: வீடியோவை இயக்கு

# newsTitle
source: Women Safety News
hi: महिला सुरक्षा समाचार
ta: பெண்கள் பாதுகாப்பு செய்திகள்

# newsDescription
source: Stay updated with the latest news and articles about women's safety and welfare
hi: महिलाओं की सुरक्षा और कल्याण के बारे में नवीनतम समाचार और लेखों से अपडेट रहें
ta: பெண்கள் பாதுகாப்பு மற்றும் நலன்புரி பற்றிய சமீபத்திய செய்திகள் மற்றும் கட்டுரைகளுடன் புதுப்பித்துக்கொள்ளுங்கள்

source: Read More
hi: और पढ़ें
ta: மேலும் படிக்க

# mapTitle
source: Safety Map
hi: सुरक्षा मानचित्र
ta: பாதுகாப்பு வரைபடம்

# mapDescription
source: View nearby safe locations and emergency services
hi: आस-पास के सुरक्षित स्थानों और आपातकालीन सेवाओं को देखें
ta: அருகிலுள்ள பாதுகாப்பான இடங்கள் மற்றும் அவசர சேவைகளைக் காண்க

source: Loading...
hi: लोड हो रहा है...
ta: ஏற்றுகிறது...

# locationError
source: Unable to get location. Please check your location settings.
hi: स्थान प्राप्त करने में असमर्थ। कृपया अपनी स्थान सेटिंग्स जांचें।
ta: இருப்பிடத்தை பெற முடியவில்லை. உங்கள் இருப்பிட அமைப்புகளை சரிபார்க்கவும்.

# locationPermissionDenied
source: Location permission denied. Please enable location services.
hi: स्थान अनुमति अस्वीकृत। कृपया स्थान सेवाएं सक्षम करें।
ta: இருப்பிட அனுமதி மறுக்கப்பட்டது. இருப்பிட சேவைகளை இயக்கவும்.

# lawsTitle
source: Laws for Women Welfare & Safety
hi: महिला कल्याण और सुरक्षा कानून
ta: பெண்கள் நலன்புரி மற்றும் பாதுகாப்பு சட்டங்கள்

source: Learn More
hi: और जानें
ta: மேலும் அறிய

# domesticViolenceAct
source: The Protection of Women from Domestic Violence Act, 2005
hi: घरेलू हिंसा से महिलाओं का संरक्षण अधिनियम, 2005
ta: குடும்ப வன்முறையிலிருந்து பெண்களைப் பாதுகாக்கும் சட்டம், 2005

# domesticViolenceDesc
source: This law provides protection to women from domestic violence and allows them to seek legal remedies, including protection orders, residence orders, and monetary relief.
hi: यह कानून महिलाओं को घरेलू हिंसा से सुरक्षा प्रदान करता है और उन्हें संरक्षण आदेश, निवास आदेश और आर्थिक राहत सहित कानूनी उपायों की मांग करने की अनुमति देता है।
ta: இந்த சட்டம் பெண்களுக்கு குடும்ப வன்முறையிலிருந்து பாதுகாப்பு வழங்குகிறது மற்றும் பாதுகாப்பு உத்தரவு, வசிப்பிட உத்தரவு மற்றும் பொருளாதார நிவாரணம் உட்பட சட்டப்பூர்வ நடவடிக்கைகளை கோர அனுமதிக்கிறது.

# workplaceHarassmentAct
source: The Sexual Harassment of Women at Workplace Act, 2013
hi: कार्यस्थल पर महिलाओं का यौन उत्पीड़न (निवारण, निषेध और निवारण) अधिनियम, 2013
ta: பணியிடத்தில் பெண்கள் பாலியல் துன்புறுத்தல் (தடுப்பு, தடை மற்றும் நிவாரணம்) சட்டம், 2013

# workplaceHarassmentDesc
source: This law ensures women's safety at workplaces by setting up an internal complaints committee for redressal of grievances.
hi: यह कानून शिकायतों के निवारण के लिए आंतरिक शिकायत समिति की स्थापना करके कार्यस्थल पर महिलाओं की सुरक्षा सुनिश्चित करता है।
ta: இந்த சட்டம் புகார்களை தீர்க்க உள் புகார் குழுவை நிறுவுவதன் மூலம் பணியிடத்தில் பெண்கள் பாதுகாப்பை உறுதி செய்கிறது.

# dowryAct
source: The Dowry Prohibition Act, 1961
hi: दहेज निषेध अधिनियम, 1961
ta: வரதட்சணை தடை சட்டம், 1961

# dowryDesc
source: This law prohibits the giving or receiving of dowry and punishes those who demand or accept dowry before or after marriage.
hi: यह कानून दहेज देना या लेना प्रतिबंधित करता है और विवाह से पहले या बाद में दहेज की मांग करने या स्वीकार करने वालों को दंडित करता है।
ta: இந்த சட்டம் வரதட்சணை கொடுப்பதை அல்லது பெறுவதை தடை செய்கிறது மற்றும் திருமணத்திற்கு முன்பு அல்லது பின்பு வரதட்சணை கோரும் அல்லது ஏற்கும் நபர்களுக்கு தண்டனை வழங்குகிறது.

# maternityAct
source: The Maternity Benefit Act, 1961 (Amended 2017)
hi: प्रसूति लाभ अधिनियम, 1961 (संशोधित 2017)
ta: மகப்பேறு நலன் சட்டம், 1961 (திருத்தப்பட்ட 2017)

# maternityDesc
source: Provides paid maternity leave up to 26 weeks for women in workplaces and ensures job security during the maternity period.
hi: कार्यस्थलों पर महिलाओं को 26 सप्ताह तक का वेतन सहित प्रसूति अवकाश प्रदान करता है और प्रसूति अवधि के दौरान नौकरी की सुरक्षा सुनिश्चित करता है।
ta: பணியிடங்களில் பெண்களுக்கு 26 வாரங்கள் வரை சம்பளத்துடன் மகப்பேறு விடுப்பு வழங்குகிறது மற்றும் மகப்பேறு காலத்தில் வேலை பாதுகாப்பை உறுதி செய்கிறது.

# childMarriageAct
source: The Prohibition of Child Marriage Act, 2006
hi: बाल विवाह निषेध अधिनियम, 2006
ta: குழந்தை திருமண தடை சட்டம், 2006

# childMarriageDesc
source: Aims to prevent child marriages and protect the rights of young girls by setting the legal marriage age at 18 for women.
hi: महिलाओं के लिए कानूनी विवाह आयु 18 वर्ष निर्धारित करके बाल विवाह को रोकने और युवा लड़कियों के अधिकारों की रक्षा करने का उद्देश्य है।
ta: பெண்களுக்கான சட்டப்பூர்வ திருமண வயது 18 ஆண்டுகளாக நிர்ணயித்து குழந்தை திருமணத்தை தடுக்கவும் இளம் பெண்களின் உரிமைகளை பாதுகாக்கவும் நோக்கமாக கொண்டுள்ளது.

# ipcSections
source: The Indian Penal Code (IPC) Sections 354, 376, 509
hi: भारतीय दंड संहिता (आईपीसी) धारा 354, 376, 509
ta: இந்திய தண்டனை சட்டம் (ஐபிசி) பிரிவுகள் 354, 376, 509

# ipcDesc
source: These sections deal with crimes against women such as assault with intent to outrage modesty, rape, and sexual harassment.
hi: ये धाराएं महिलाओं के खिलाफ अपराधों से संबंधित हैं जैसे लज्जा भंग करने के इरादे से हमला, बलात्कार और यौन उत्पीड़न।
ta: இந்த பிரிவுகள் பெண்களுக்கு எதிரான குற்றங்களுடன் தொடர்புடையவை, அதாவது கற்பழிப்பதற்கான தாக்குதல், கற்பழிப்பு மற்றும் பாலியல் துன்புறுத்தல்.

# mtpAct
source: The Medical Termination of Pregnancy (MTP) Act, 1971 (Amended 2021)
hi: गर्भपात अधिनियम, 1971 (संशोधित 2021)
ta: மருத்துவ கருக்கலைப்பு சட்டம், 1971 (திருத்தப்பட்ட 2021)

# mtpDesc
source: Allows women to safely terminate pregnancies under certain legal conditions and extends abortion rights for unmarried women as well.
hi: कुछ कानूनी शर्तों के तहत महिलाओं को सुरक्षित रूप से गर्भपात करने की अनुमति देता है और अविवाहित महिलाओं के लिए भी गर्भपात के अधिकार का विस्तार करता है।
ta: சில சட்டப்பூர்வ நிபந்தனைகளின் கீழ் பெண்களுக்கு பாதுகாப்பாக கருக்கலைப்பு செய்ய அனுமதி அளிக்கிறது மற்றும் திருமணமாகாத பெண்களுக்கும் கருக்கலைப்பு உரிமையை விரிவுபடுத்துகிறது.

# hinduSuccessionAct
source: The Hindu Succession Act, 1956 (Amended 2005)
hi: हिंदू उत्तराधिकार अधिनियम, 1956 (संशोधित 2005)
ta: இந்து மரபுரிமை சட்டம், 1956 (திருத்தப்பட்ட 2005)

# hinduSuccessionDesc
source: Gives equal inheritance rights to women in ancestral property, ensuring gender equality in property ownership.
hi: पैतृक संपत्ति में महिलाओं को समान उत्तराधिकार अधिकार देता है, संपत्ति स्वामित्व में लैंगिक समानता सुनिश्चित करता है।
ta: பிதிரார்ஜித சொத்தில் பெண்களுக்கு சம உரிமை வழங்குகிறது, சொத்து உரிமையில் பாலின சமத்துவத்தை உறுதி செய்கிறது.

# indecentRepresentationAct
source: The Indecent Representation of Women Act, 1986
hi: महिलाओं का अश्लील प्रदर्शन (निषेध) अधिनियम, 1986
ta: பெண்களின் அநாகரிக பிரதிநிதித்துவம் (தடை) சட்டம், 1986

# indecentRepresentationDesc
source: Prohibits indecent or derogatory representation of women in advertisements, publications, and online platforms.
hi: विज्ञापनों, प्रकाशनों और ऑनलाइन प्लेटफॉर्मों पर महिलाओं का अश्लील या अपमानजनक प्रदर्शन प्रतिबंधित करता है।
ta: விளம்பரங்கள், வெளியீடுகள் மற்றும் ஆன்லைன் தளங்களில் பெண்களின் அநாகரிக அல்லது அவமதிப்பான பிரதிநிதித்துவத்தை தடை செய்கிறது.
